IDEA Open Model
PolyLine2D Class
Compatible with IDEA StatiCa Beta 20.0
 Represents a polyline in two-dimensional space.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Geometry2D.PolyLine2D
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class PolyLine2D : OpenObject
Public Class PolyLine2D
	Inherits OpenObject
The PolyLine2D type exposes the following members.
Constructors
Name | Description
PolyLine2D
 Constructor
Top
Properties
Name | Description
Segments
 Gets segments of PolyLine2D.
StartPoint
 Gets or sets the point where the PolyLine2D begins.
Top
See Also
Reference
IdeaRS.OpenModel.Geometry2D Namespace